{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 50], "trainable": true, "use_bias": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}]}}